
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Найти элемент справочника1.
// 
// Параметры:
//  Наименование Наименование
// 
// Возвращаемое значение:
//  Неопределено, СправочникСсылка.Справочник1 - Найти элемент справочника1
Функция НайтиЭлементСправочника1(Знач Наименование) Экспорт
	Возврат Справочники.Справочник1.НайтиПоНаименованию(Наименование, Истина);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
